{"intents":[
    {"tag": "unrecognized",
    "patterns":[""],
    "responses": ["Sorry, this text could not be recognized.","I could not understand that. Could you rephrase that?", "Please enter a recognizable phrase.", "Could you say something different?", "Text not recognized."]
    },
    {"tag": "greetings",
    "patterns":["hello", "hey", "hi", "good day", "greetings", "whats up", "how is it going?"],
    "responses": ["Hello, I am the UBCO Chatbot", "Hi, how can I help you today?", "Hello from UBCO, how can I help you?"]
    },
    {"tag":"farewell",
    "patterns":["Thanks for your help, bye", "bye", "Thank you", "Good bye", "goodbye", "farewell"],
    "responses":["Have a nice day!", "I hope that helped, bye.", "Bye, hope to see you on Campus!"]
    },
    {"tag":"opening hours",
    "patterns":["When University open", "when can access the university", "What are working hours", "opening hours"],
    "responses":["The opening hours of the university vary, depending on where you want to go. The Commons are always open if you want to study, why don't you have a look at our website? (https://finance-operations.ok.ubc.ca/corm/building-hours/)"]
    },
    {"tag":"semester dates",
    "patterns":["When teaching times", "when lectures on campus", "When do courses start", "semester date dates starts"],
    "responses":["University usually starts in September, with exams in December. The second term starts in January, with finals in April."]
    },
    {"tag":"sports teams",
    "patterns":["Does UBC have sport teams", "What sport teams can support", "Are any sports watch on campus"],
    "responses":["UBC Okanagan's sport teams are called HEAT, have soccer, basketball, volleyball and golf teams for men and women, as well as a softball team"]
    }, 
    {"tag":"gym",
    "patterns":["Is there gym on campus", "Can where work out at uni", "do you have a gym", "can play sports on campus"],
    "responses":["There is a gym on campus called the Hangar. Why don't you check it out here? https://recreation.ok.ubc.ca/facilities/hangar-fitness-wellness-centre/"]
    },
    {"tag":"learning spaces",
    "patterns":["Where can I study on campus", "do you have work places", "are there open study spaces", "learning spaces"],
    "responses":["There are various places on campus you can study. For example: the Commons, Sunshine cafe, the library or maybe outside when the sun is shining."]
    },
    {"tag":"food",
    "patterns":["Are there any food places on campus", "What food is there on campus", "What if I am hungry", "Where can I eat on campus", "What if I want something to eat"],
    "responses":["The campus offers a variety of cafes and food places, like Tim Hortons, Starbucks or the sushi place. We also have a big dining hall. Check it out here: https://food.ok.ubc.ca"]
    },
    {"tag":"library",
    "patterns":["What are the opening hours of the library", "When does the library open", "When does the library close"],
    "responses":["The library is open from 8 am to 8 pm weekdays and from 10 am to 6 pm on weekends."]
    },
    {"tag":"location",
    "patterns":["Where is UBC located", "Where are you",  "Where is it", "location"],
    "responses":["UBCO is located at Lake Okanagan, near Kelowna."]
    },
    {"tag":"transfer",
    "patterns":["How can I get to UBC", "How can I get to UBCO", "How to get to Kelowna from UBC", "travel to campus"],
    "responses":["If you come from outside the province, it is easiest to fly into Kelowna International Airport and take a taxi from there. If you are living in Kelowna, there are regular buses to UBCO."]
    },
    {"tag":"number of students",
    "patterns":["How many students does UBCO have", "Number of student students at UBC", "How many people study at UBCO"],
    "responses":["UBCO has about 9000 students."]
    },
    {"tag":"other attractions",
    "patterns":["What else can I do at UBC", "What can I do when not studying", "Are there any fun things to do around", "other attractions", "other thing to do"],
    "responses":["In winter, Big white is nearby if you fancy skiing.", "It is always nice to hang out at Okanagan lake.", "There is a wide variety of activities offered by Recreation. Check it out here: https://recreation.ok.ubc.ca"]
    },
    {"tag":"application",
    "patterns":["How can I apply to UBC", "Where can I apply", "When is the application deadline?", "How to get into UBCO", "where submit application", "applying to UBCO"],
    "responses":["The application deadline to UBC is usually mid January. Please find further details here: https://you.ubc.ca/applying-ubc/blog/how-to-apply/ubc-application-open/"]
    },
    {"tag":"history",
    "patterns":["How old is UBC", "Tell me more about the history of UBC", "When did UBCO open", "UBCO history"],
    "responses":["The Okanagan Campus was opened in 2005. If you want to know more, please take a look here: https://ok.ubc.ca/about/history-and-milestones/"]
    },
    {"tag":"difference UBC Okanagan and Vancouver",
    "patterns":["Is UBC Okanagan and Vancouver the same", "What is the difference between UBC Okanagan and Vancouver", "Difference UBCO and UBC Vancouver"],
    "responses":["The biggest difference between both the campuses is the size. UBCV is significantly larger school than UBCO. UBCV is home to about 60,000 students whereas UBCO is home to about 10,000 students. The rest of the differences stem from the size itself."]
    },
    {"tag":"weather",
    "patterns":["How is the weather UBC", "Is it cold at UBC", "Does it rain a lot at UBC"],
    "responses":["The weather in summer is pretty warm and dry and it is fairly cold in the winters."]
    },
    {"tag":"Off-campus Food",
    "patterns":["where eat off-campus ?", "where can use student meal plan off-campus?", "off-campus food", "off campus food"],
    "responses":["The UBC Okanagan campus has multiple off campus dining partners which you can find at https://food.ok.ubc.ca/feed-me/  ."]
    },
     {"tag":"Tutoring ",
    "patterns":["Does ubco offer tutoring services?", "find tutors at ubco?", "I need help with my assignment, who can help me", "I have troubles understanding the material, is there any support for students in such situation"],
    "responses":["UBCO offers free tutoring services at the student learning hub, which you can learn more about at: https://students.ok.ubc.ca/academic-success/learning-hub/subject-tutoring/"]
    },
     {"tag":"on campus Housing",
    "patterns":["What kind of housing is available on campus ?", "where can I live on campus ?", "Does UBCO has student residences", "Are there dorms in UBCO"],
    "responses":["UBCO is home to 10 student residences including Cassiar, Kalamalka, Nicola, Purcell, Valhalla, Skeena, Nechako, Similkameen, Lower/Upper Cascades, and Monashee. You can learn more about the different residences at: https://okanagan.housing.ubc.ca/residences-rooms/residences/"]
    },
      {"tag":"off campus Housing",
    "patterns":["What kind of housing is available off campus ?", "where can I live off campus ?", "How do I rent a room off campus"],
    "responses":["There are plenty of places to rent off campus. Renting on Academy Way is a nearby option. Buildings such Veda Living, U Buildings , and Ivy Hall are popular choices."]
    },
     {"tag":"minor",
    "patterns":["What can I minor in?", "What are the requirements for a minor ?"],
    "responses":["There are several minors you can specialize in by taking a specific selection of courses. Each minor has a specific set of requirements which you can learn more about at: https://fass.ok.ubc.ca/programs/undergraduate/ "]
    },
     {"tag":"getting involved",
    "patterns":["How can I get involved on campus?", "What involvement opportunities are on campus", "getting involved"],
    "responses":[" You can get involved on campus by volunteering, getting an on-campus job, joining clubs, and/or course unions. Learn more about getting involved at: https://students.ok.ubc.ca/involvement-activities/get-involved/ "]
    },
    {"tag":"facts",
    "patterns":["What are some facts about UBCO?", "What general information can I get about UBCO ?", "Tell me something about UBCO"],
    "responses":["UBC is among the top 20 universities in the world. It has a good ratio of around 1 teacher for every 23 students. 17% of UBCO students are international. You can find more UBCO facts and information at: https://ok.ubc.ca/about/facts-and-figures"]
    },
      {"tag":"Research ",
    "patterns":["What are some research opportunities at UBCO ?", "How can I get involved with undergraduate research?", "research", "research opportunity"],
    "responses":["Research opportunities include health research projects, as well as the Tuum Est fund  which provides financial support for student initiatives, conferences, and competitions. Learn more about the fund at: https://students.ok.ubc.ca/career-experience/get-experience/undergraduate-research/"]
      },
     {"tag":"Health and Wellness ",
    "patterns":["mental health resources available","Does UBCO offer counselling?", "I feel am  depressed", "I feel am anxious", "help me my mental struggles", "health and wellness"],
    "responses":["UBCO offers free mental health counselling to students to help them deal with a variety of issues including anxiety, stress, panic, depression, or suicidal thoughts and feelings. Learn more at: https://students.ok.ubc.ca/health-wellness/counselling-mental-health/ "]
      },
     {"tag":"Degree planning ",
    "patterns":["which courses need needed for my degree?", "help with planning my degree?", "which courses I should take?", "degree planning help"],
    "responses":["The degree navigator, which can be found on the SSC website, offers guidance on planning your degree. It allows you to view program requirements, view course information as outlined in the UBC Okanagan Academic Calendar, evaluate your progress towards program requirements , and plan hypothetical course scenarios for future sessions. Learn more at: https://students.ok.ubc.ca/academic-success/degree-planning/"]
     },
    {"tag": "Safety",
    "patterns": ["Then I am on campus I do not feel safe walking alone at night, what do I do?", "I am worried about stealing theft robbed robbery or other crimes", "worried about safety protocols on campus, students are protected enough?", "how UBCO ensures safety and security on campus"],
    "responses": ["UBCO treats the safety of its students as its top priority. There are always security guards monitoring the situation on campus. You can see them near the administration building. UBCO also offers Safewalk Services in case you are afraid of walking alone at night. To find out more, visit: https://security.ok.ubc.ca/safewalk/. If you are concerned about general security or want to report a crime, visit: https://security.ok.ubc.ca/"]
    }
    ]}
    
